{
  "url":"https://api.github.com/repos/athensresearch/athens/pulls/comments/429790069",
  "pull_request_review_id":417522803,
  "id":429790069,
  "node_id":"MDI0OlB1bGxSZXF1ZXN0UmV2aWV3Q29tbWVudDQyOTc5MDA2OQ==",
  "diff_hunk":"@@ -0,0 +1,127 @@\n+- [A Self-Hosted Athens](#a-self-hosted-athens)\n+- [An Invidual Memex](#an-invidual-memex)\n+- [A Collective Memex](#a-collective-memex)\n+  - [A Protocol for Bi-directionality](#a-protocol-for-bi-directionality)\n+  - [A Protocol for Knowledge Markets](#a-protocol-for-knowledge-markets)\n+- [A Community for Collaboration and Learning](#a-community-for-collaboration-and-learning)\n+\n+> There is nothing impossible to him (or her) who will try.\n+\n+— Alexander the Great\n+\n+This document can be read alongside [Athens Vision Mindmap v2](https://www.notion.so/athensresearch/Athens-Roadmap-Mindmap-v2-096427f189b648729ae0acbdcefd4c6f?showMoveTo=true).\n+\n+# A Self-Hosted Athens\n+\n+Roam Research is a \"note-taking tool for networked thought.\" Roam creates value because it allows users to create knowledge associatively, divergently, and then emergently.\n+\n+This is more important now than ever before because in the past few decades we've seen an exponential growth in data and information. However, our ability to make sense of these inputs, to convert data and information to knowledge and wisdom, is already capped by the mainstream tools today.\n+\n+Using a graph database, bi-directional links, and hypertext transclusions, Roam enables users to create and traverse knowledge in a way that mirrors how humans organically create knowledge — associatively and contextually.\n+\n+By breaking out of the \"file-and-cabinet\" hierarchical paradigm that most computer systems use — note-taking apps,  filesystems, HTML documents, etc. — Roam users can more easily create meaningful relationships about the world we live in. Not only that, users can then more easily recontextualize relationships, allowing ideas to compose and refactor in emergent ways. This leads to the creation of more insights, more interdisciplinary insights, and generative insights: insights that create more interdisciplinary insights.\n+\n+In short, we are currently experiencing diminishing and marginal returns on information. Roam promises exponential and compound returns.\n+\n+That's Roam. But this is Athens. So why Athens, why open-source? Because Roam always should've been open-source.\n+\n+Many users already report that they are getting massive returns on their Roam databases. They've found perhaps the currently closest approximation to [Vannevar Bush's memex](https://www.theatlantic.com/magazine/archive/1945/07/as-we-may-think/303881/). Users right now are putting their entire personal lives, unencrypted, on Roam and therefore Google Firebase.\n+\n+This isn't about Roam's ethics, either. This is about users putting their second brains — their entire lives — on a public cloud. In plain-text. To be summoned at will by the government ([Facebook Transparency](https://transparency.facebook.com/government-data-requests/country/US), [Google Transparency](https://transparencyreport.google.com/user-data/overview?hl=en)).\n+\n+A self-hosted Athens solves this privacy and security problem.\n+\n+# An Invidual Memex\n+\n+The closest approximations we have to the brain are Roam and neural networks. Both of these are graphs with bi-directional data flows.\n+\n+What makes Roam different from other Tools for Thought is bi-directional links and transclusions (which are just richer bi-directional links).\n+\n+Of course, it's not *just* bi-directional links. Any note-taking app can support bi-directional links with some string parsing. It's also the fact that Roam is built on top of a graph database.\n+\n+To acquire exponential returns on knowledge, we will need to be able to navigate and manipulate exponentially large datasets. Datasets that approach Wikipedia and Google scale.\n+\n+We will need specific features like graph visualizations as well as an industrial data query language (Datalog) that can represent and operate on thousands if not millions of nodes and blocks.\n+\n+Knowledge at scale requires a data model that is more robust than a collection of markdown files.\n+\n+Athens has implemented bi-directional links and transclusions. This can be and has been done in under 100 lines of Clojure and Datascript.\n+\n+Everything else — the sidebar, queries, the graph visualization — are being redesigned from the ground up.\n+\n+- How might tables and queries in Athens be as powerful as tables in Airtable, Notion, or Excel?\n+- How might we more fully leverage our spatial and visual senses with a dynamic and interactive knowledge graph? See [interactive graph visualization (#21)](https://github.com/athensresearch/athens/issues/21).\n+- What if Athens was as extensible as Emacs and Vim? As interactive as Smalltalk and LightTable? And most importantly, as easy as Myspace? See [plugin architecture (#63)](https://github.com/athensresearch/athens/issues/63).\n+\n+# A Collective Memex\n+\n+The closest approximation we have to a global brain is the Web. But even still, the Web is far from a collective memex.\n+\n+As already mentioned, a memex is probably a bi-directional graph, whereas the Web is only uni-directional.\n+\n+This means the Web needs bi-directionality within more apps. And then it needs bi-directionality between apps.\n+\n+## A Protocol for Bi-directionality\n+\n+The Web should've always have been bi-directional. The reason why it's not is because it's a security nightmare. Letting someone write to your website or server by simply linking to your domain necessarily opens you up to malicious exploits. There have been a [few unsuccessful attempts at notifications](https://en.wikipedia.org/wiki/Linkback) when someone links to your blog. Even these have led to [DDoS attacks](https://en.wikipedia.org/wiki/Pingback).\n+\n+We need a chat messenger like the one [Max Krieger](http://a9.io/glue-comic/) envisions. Chat is one of the clearest examples of diminishing returns on knowledge. If you don't check Slack for one day, you'll never catch up. Even if you do, good luck finding it again. Furthermore, aside from these diminishing returns on data, conversations are naturally networked and self-referential. But all we have right now is a ceasless tidal wave of messages represented as an append-only log. Managing it all with search, one level of threads, and channels is Sisyphean at best.\n+\n+We also need an IDE that can seamlessly integrate specs, documentation, and code. When we only look at source code, we lose out on so much: previous versions the code evolved from, alternative implementations on different branches and forks, and the conversation between developers happening on issues and PRs. [Unison](https://www.unisonweb.org/docs/tour), [darklang](https://darklang.com/), [repl.it](https://repl.it/), and [ObservableHQ](http://observablehq.com/)  are showing us the power of tooling and languages that treat the Web as a first-class citizen. With WASM and GraalVM on the horizon, soon we'll be able to write and run any code anywhere. We should have IDEs and languages that are similarly flexible, that can exploit modern UIs and distributed backends.\n+\n+This is a lot to ask out of any one app. That's why we have specific apps for specific purposes. The point here is that while a lot can be done using bi-directional links within an app, far more could be done using bi-directional links between apps. [Apps today are siloed](https://uxdesign.cc/introducing-mercury-os-f4de45a04289). A protocol that enables apps to securely communicate data between one another would break down these siloes. This would give you, the end-user, vastly more power.\n+\n+Bi-directional links aren't necessary for everything, they're not going to save the world (although they might; see next section). But many of these apps are just UIs over your personal data. You should have greater control and power over your data.\n+\n+## A Protocol for Knowledge Markets\n+\n+The closest approximation we have to a global brain is the ~~Web~~ Market. Federal banks aside, the Market does a pretty good job of finding supply and demand equilibria for 7.6 billion agents all with different preferences on the price, volume, and quality of different goods and services.\n+\n+But the Efficient Market hypothesis seems to be failing in a few places: healthcare, education, and knowledge. Athens is directly focused on knowledge. What is the problem here?\n+\n+> There is currently little accountability for predictions. Politicians make baseless predictions with no accountability, while the media profits from sensationalist journalism. Pundits of all stripes have no skin in the game. Even when they get things wrong, they typically don’t go back to correct themselves. Experts don’t have incentives to speak up. Too much to lose.\n+\n+> Charlatans, however, make baseless predictions to build an audience. If they’re wrong, their tribe still supports them. Celebrities are winning The War of Ideas. Tribalism above truth. Entertainment over everything.\n+\n+— Erik Torenberg, \"[A Primer On Prediction Markets](https://www.tokendaily.co/blog/a-primer-on-prediction-markets)\"\n+\n+What, if instead, we had what Mike Elias describes as:\n+\n+```\n+- A protocol for the battlefield of ideas\n+- A protocol for trustless credibility\n+- A protocol for defining reality without media corporations\n+- A protocol for harnessing greed to empower curiosity\n+- A protocol for capturing the value of obscure genius\n+- A protocol for perpetual scientific and cultural revolution\n+- A protocol for killing bad ideas\n+- A protocol for rendering propaganda powerless\n+- A protocol for making credibility harder to achieve by force than by merit\n+- A protocol for using price discovery to advance discovery\n+- A protocol for creating high-quality common knowledge\n+- A perpetual global dashboard for sincere belief\n+- An authority without authorities\n+- An intellectual gold mine\n+```\n+\n+— Mike Elias, \"[Decentralizing the search for truth using idea markets](https://medium.com/@harmonylion1/decentralizing-the-search-for-truth-using-financial-markets-648bf4408b5c)\"\n+\n+It's unclear whether prediction markets, idea markets, or ultimately knowledge markets will solve the epistemic crisis we're currently in.\n+\n+It's unlikely that just a protocol will be the silver bullet.\n+\n+What is clear is that the current platforms (Facebook and Google) and knowledge institutions (media corporations, governments, and universities) don't appear to be up to the job.\n+\n+What is likely is that knowledge graphs are here to stay.\n+\n+That multiplayer, joinable knowledge graphs will follow.\n+\n+And that we need to start getting exponential returns on collective intelligence.\n+\n+# A Community for Collaboration and Learning\n+\n+Lastly, the final Athens vision is for everyone, one day, to learn how to learn anything.\n+\n+To do that, it is mission critical to create a space and culture where we can [work with one another and learn from one another](https://github.com/athensresearch/athens/blob/master/CODE_OF_CONDUCT.md).",
  "path":"VISION.md",
  "position":null,
  "original_position":125,
  "commit_id":"1df38e3865680f980b7d8f99e9938f5cfdef2773",
  "original_commit_id":"18190c5945c52bf649122ee82284e091c993bad3",
  "user":{
    "login":"KasperZutterman",
    "id":21260838,
    "node_id":"MDQ6VXNlcjIxMjYwODM4",
    "avatar_url":"https://avatars0.githubusercontent.com/u/21260838?v=4",
    "gravatar_id":"",
    "url":"https://api.github.com/users/KasperZutterman",
    "html_url":"https://github.com/KasperZutterman",
    "followers_url":"https://api.github.com/users/KasperZutterman/followers",
    "following_url":"https://api.github.com/users/KasperZutterman/following{/other_user}",
    "gists_url":"https://api.github.com/users/KasperZutterman/gists{/gist_id}",
    "starred_url":"https://api.github.com/users/KasperZutterman/starred{/owner}{/repo}",
    "subscriptions_url":"https://api.github.com/users/KasperZutterman/subscriptions",
    "organizations_url":"https://api.github.com/users/KasperZutterman/orgs",
    "repos_url":"https://api.github.com/users/KasperZutterman/repos",
    "events_url":"https://api.github.com/users/KasperZutterman/events{/privacy}",
    "received_events_url":"https://api.github.com/users/KasperZutterman/received_events",
    "type":"User",
    "site_admin":false
  },
  "body":"```suggestion\r\nTo do that, it is mission-critical to create a space and culture where we can [work with one another and learn from one another](https://github.com/athensresearch/athens/blob/master/CODE_OF_CONDUCT.md).\r\n```",
  "created_at":"2020-05-25 08:01:20 UTC",
  "updated_at":"2020-05-25 20:26:15 UTC",
  "html_url":"https://github.com/athensresearch/athens/pull/82#discussion_r429790069",
  "pull_request_url":"https://api.github.com/repos/athensresearch/athens/pulls/82",
  "author_association":"NONE",
  "_links":{
    "self":{
      "href":"https://api.github.com/repos/athensresearch/athens/pulls/comments/429790069"
    },
    "html":{
      "href":"https://github.com/athensresearch/athens/pull/82#discussion_r429790069"
    },
    "pull_request":{
      "href":"https://api.github.com/repos/athensresearch/athens/pulls/82"
    }
  },
  "start_line":null,
  "original_start_line":null,
  "start_side":null,
  "line":null,
  "original_line":125,
  "side":"RIGHT"
}